Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རྡོ་རྗེའི་དྲིལ་སྣ་ཚོགས་ལས་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཐམས་ཅད་ཀྱི་སྒྲ་རབ་ཏུ་འབྱུང་བ།
en: From a variety of diamond bells came the sounds of all bodhisattva prayers.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ཟླ་བའི་རྒྱལ་མཚན་གྱི་ཕྲེང་བས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་རབ་ཏུ་འབྱུང་བའི་དབྱངས་སྣ་ཚོགས་རབ་ཏུ་བསྒྲག་པ།
en: Various voices resounded from the images of all the buddhas that arose from strings of moonstone kings of jewels.

source: ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྙིང་པོ་དག་པའི་ཕྲེང་བས་དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྐུ་ཚེ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པའི་གཟུགས་བརྙན་རྣམ་པར་དམྱིགས་པར་བྱ་བ།
en: From strings of emerald kings of precious jewels came manifestations of images of the successive lives of all the tathāgatas in the three times.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ཉི་མའི་སྙིང་པོའི་ཕྲེང་བས་ནམ་མཁའི་དབྱིངས་ཀྱི་མཐས་ཀླས་པའི་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་སྣ་ཚོགས་ཀྱི་དབྱིངས་སུ་འོད་ཟེར་ཡོངས་སུ་བསྟན་པ།
en: From strings of sunstone kings of jewels appeared light rays of the range of various buddha realms throughout the ten directions as far as the limits of the realm of space.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣང་བའི་རྒྱལ་མཚན་གྱི་ཕྲེང་བས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འོད་ཀྱི་དཀྱིལ་འཁོར་སྣང་བ་རབ་ཏུ་བཀྱེ་བ།
en: From strings of avabhāsadhvaja kings of jewels shone the illumination of the halos of light of all the tathāgatas.

source: ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་རྣམ་པར་སྣང་བའི་ཕྲེང་བས་སྤྲུལ་པའི་སྤྲིན་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དབང་པོ་ལྟ་བུ་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་ཅིང་རིམ་གྲོར་བྱེད་པའི་འོད་རབ་ཏུ་དགྱེ་བ།
en: From strings of vairocana kings of jewels radiated light rays in the forms of emanated clouds of all the lords of worlds, who made offerings to and venerated the tathāgatas.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་ཡིད་བཞིན་གྱི་ཕྲེང་བས་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་རྣམ་པར་འཕྲུལ་པས་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་སུ་རྒྱས་པར་དགང་བ།
en: From strings of wish-fulfilling kings of jewels there spread throughout the realm of phenomena in each instant the completely good miraculous manifestations of the bodhisattvas.

source: རིན་པོ་ཆེའི་རྒྱལ་པོ་རི་བོའི་རྒྱལ་མཚན་གྱི་ཕྲེང་བས། ལྷའི་དབང་པོ་ཐམས་ཅད་ཀྱི་ཁྱིམ་གྱི་ལྷ་མོའི་དབྱངས་སྙན་པ་རབ་ཏུ་བསྒྲག་པ་དང་ལྡན་ཞིང་ཁྲི་དེ། དམིགས་པ་ཐམས་ཅད་དུ་དེ་བཞིན་གཤེགས་པ་ལ་བསྟོད་པའི་སྤྲིན་འགྱེད་པས་ཡོན་ཏན་དང་། ལེགས་པ་བསམ་གྱིས་མི་ཁྱབ་པ་བརྗོད་དུ་ཡོད་པ་དང་།
en: From strings of vairocana kings of jewels resounded the sound of the voices of all the apsarases in the palaces of all the lords of devas emitting clouds of praises of all perceived tathāgatas, describing their inconceivable good qualities.

source: རིན་པོ་ཆེའི་རྒྱན་གྲངས་མེད་པའི་འཁོར་གྱི་སྟན་གྱིས་བསྐོར་བར་མཐོང་ངོ་། །
en: The throne was encircled by an array of seats made of countless jewels. He saw upon that throne Māyādevī.

source: ཁྲི་དེ་ལ་ལྷ་མོ་སྒྱུ་མ་འཇིག་རྟེན་གསུམ་ལས་ཡང་དག་པར་འདས་པའི་གཟུགས་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་པར་གནས་པ་དང་།
en: She had a form that transcended the three worlds.

source: སྲིད་པའི་རྒྱུད་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་དམིགས་སུ་ཡོད་པ་དང་།
en: She had a form that resided in all worlds and was above all existences.

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་མ་གོས་པའི་གཟུགས་བསོད་ནམས་ཡངས་པས་བྱུང་བ་དང་།
en: She had a form that was perceived by all beings according to their aspirations but was unstained by any world.

source: འགྲོ་བ་ཐམས་ཅད་དང་མཉམ་ཞིང་འདྲ་བའི་གཟུགས་སེམས་ཅན་ཐམས་ཅད་ལ་རང་བཞིན་མངོན་པར་སྟོན་པ་དང་།
en: She had a form that originated from vast merit and could resemble that of all beings.

source: འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བར་མཐུན་པའི་གཟུགས་སེམས་ཅན་ཐམས་ཅད་དང་མངོན་སུམ་དུ་འདལ་བ་དང་།
en: She had a form that appeared to all beings but in a way that would accord with ripening and guiding all beings.

source: དུས་གསུམ་ཐམས་ཅད་དུ་འགྲོ་བ་ནམ་མཁའ་ལ་རྣམ་པར་དམིགས་པ་ཐ་མི་དད་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་མཐས་ཀླས་པར་དམིགས་སུ་ཡོད་པར་བྱིན་གྱིས་རློབ་པ་དང་།
en: She had a form that was directly perceived by all beings but was at all times no different from beings’ perception of space. She had a form that had the power to be present as perceivable throughout the extent of all beings without going anywhere.

source: འགྲོ་བ་མེད་པའི་གཟུགས་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་འགག་པ་དང་།
en: She had a form that neither ceased nor came into existence within worlds.

source: འོང་བ་མེད་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་དུ་མ་བྱུང་བ་དང་།
en: She had a form that did not originate in and was not born in any world.

source: མ་སྐྱེས་པའི་གཟུགས་མི་སྐྱེ་བར་མཉམ་པའི་ཆོས་ལ་བརྩོན་པ་དང་།
en: She had a form that was dedicated to having a quality the same as birthlessness but was also unceasing.

source: མ་འགགས་པའི་གཟུགས་འཇིག་རྟེན་གྱི་རྣམ་པར་སྤྱོད་པ་ཐམས་ཅད་ལ་གཞོལ་བ་དང་། ཡང་དག་པར་དམིགས་པའི་གཟུགས་བདེན་པ་མེད་པ་དང་།
en: She had a form that engaged in all conducts within the world and was truly perceived.

source: འཇིག་རྟེན་གྱི་རྣམ་པར་དམིགས་པའི་གཟུགས་བརྫུན་པ་མེད་པ་དང་།
en: She had a form that was not real but was perceived by the world.

source: འཕོ་བ་མེད་པའི་གཟུགས་ཤི་འཕོ་བ་དང་།
en: She had a form that was not false and did not pass away.

source: སྐྱེ་བ་ལས་འདས་པ་དང་།
en: She had a form that transcended death and birth and was indestructible.

source: མི་འཇིག་པའི་གཟུགས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་རང་བཞིན་གྱིས་འཇིག་པ་མེད་པ་དང་།
en: She had a form that had the indestructible nature of the realm of the Dharma and had no characteristics.

source: མཚན་ཉིད་མེད་པའི་གཟུགས་དུས་གསུམ་ཚིག་གི་ལམ་དུ་གཞོལ་བ་དང་།
en: She had a form that mastered the languages of the three times and had a single characteristic.

source: མཚན་ཉིད་གཅིག་པའི་གཟུགས་མཚན་ཉིད་མེད་པས་བྱུང་བ་དང་།
en: She had a form that came forth with the excellent characteristic of the absence of characteristics and was like a reflection.

source: གཟུགས་བརྙན་ལྟ་བུའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་དང་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དམིགས་པ་དང་།
en: She had a form that was perceived by all beings in accordance with their motivations and aspirations and was like an illusion.

source: སྒྱུ་མ་ལྟ་བུའི་གཟུགས་ཡེ་ཤེས་སྒྱུ་མས་ཡོངས་སུ་གྲུབ་པ་དང་།
en: She had a form that was created by the illusion of wisdom and was like a mirage.

source: སྨིག་རྒྱུ་བ་ལྟ་བུའི་གཟུགས་འགྲོ་བའི་འདུ་ཤེས་བཞིན་དུ་བྱིན་གྱིས་རློབ་པ་ལ་གཞོལ་བ་དང་།
en: She had a form that was intent on being present in the perception of beings in each instant and was like a shadow.

source: གྲིབ་མ་ལྟ་བུའི་གཟུགས་སྔོན་གྱི་སྨོན་ལམ་གྱིས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འབྲང་བ་དང་།
en: She had a form that followed beings in accordance with her past prayers and was like a dream.

source: རྨི་ལམ་ལྟ་བུའི་གཟུགས་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བས་དམིགས་པ་ལ་མ་འདྲེས་པ་དང་།
en: She had a form that was perceived separately by beings according to their dispositions and was active in the entire realm of phenomena.

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་གཞོལ་བའི་གཟུགས་ནམ་མཁའི་དབྱིངས་ལྟར་རང་བཞིན་ཡོངས་སུ་དག་པ་དང་།
en: She had a form that had a pure nature like the realm of space and arose from great compassion.

source: སྙིང་རྗེ་ཆེན་པོས་བྱུང་བའི་གཟུགས་སེམས་ཅན་གྱི་རྒྱུད་ཐམས་ཅད་ཡོངས་སུ་བསྐྱང་བ་ལ་བརྩོན་པ་དང་།
en: She had a form that was dedicated to protecting all the classes of beings and arose through the gateway of the absence of attachment.

source: ཆགས་པ་མེད་པའི་སྒོས་བྱུང་བའི་གཟུགས་སྐད་ཅིག་རེ་རེས་ཆོས་ཀྱི་དབྱིངས་རྒྱས་པར་འགེངས་པ་དང་།
en: She had a form that pervaded in each instant the entire realm of phenomena and had no end or middle.

source: མཐའ་དང་དབུས་མེད་པའི་གཟུགས་རྙོག་པ་མེད་པར་འགྲོ་བ་ཐམས་ཅད་ལ་རྟེན་པ་དང་།
en: She had a form that was dependent on all beings without being polluted by them and was immeasurable.

source: ཚད་མེད་པའི་གཟུགས་ཚིག་གི་ལམ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པ་དང་།
en: She had a form that transcended all words and had no location.

source: མི་གནས་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་གདུལ་བའི་བྱིན་གྱི་རླབས་ཀྱིས་གྲུབ་པ་དང་།
en: She had a form that was an accomplished presence that guided all beings and had no presence.

source: བྱིན་གྱིས་མ་བརླབས་པའི་གཟུགས་བྱིན་གྱི་རླབས་ཀྱིས་འགྲོ་བའི་དོན་ལ་བརྩོན་པ་དང་།
en: She had a form that through its presence was dedicated to benefiting beings and did not occur.

source: མ་བྱུང་བའི་གཟུགས་སྨོན་ལམ་སྒྱུ་མས་ཡོངས་སུ་གྲུབ་པ་དང་།
en: She had a form that was created through the conjured illusion of prayer and was unsurpassable.

source: ཟིལ་གྱིས་མ་ནོན་པའི་གཟུགས་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་དང་།
en: She had a form that was above all worlds and was not what it seemed to be.

source: ཡང་དག་པ་མ་ཡིན་པའི་གཟུགས་ཞི་གནས་ཀྱི་སྣང་བས་རྣམ་པར་དམིགས་པ་དང་།
en: She had a form that was perceived through the light of śamatha and was without origin.

source: མི་འབྱུང་བའི་གཟུགས་འགྲོ་བའི་ལས་ཇི་ལྟ་བ་བཞིན་དུ་རྗེས་སུ་འབྲང་བ་དང་། རིན་པོ་ཆེ་ཡིད་བཞིན་གྱི་རྒྱལ་པོ་ལྟར་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་སྨོན་ལམ་ཡོངས་སུ་གྲུབ་པ་དང་།
en: She had a form that followed beings in accordance with their karma and accomplished the prayers to fulfill the wishes of all beings like the king of wish-fulfilling jewels, without thought.

source: རྣམ་པར་མི་རྟོག་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཡོངས་སུ་རྟོག་པ་བཞིན་དུ་ཉེ་བར་གནས་པ་དང་།
en: She had a form that was present in accordance with the conceptions of all beings and, having no thought, was nonconceptual.

source: མི་རྟོག་པས་རྟོག་པ་མེད་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་དམིགས་པ་དང་།
en: She had a form that was perceived by all beings and was without impediment.

source: ཐོགས་པ་མེད་པའི་གཟུགས་འཁོར་བ་ལས་བཟློག་པ་ལ་རབ་ཏུ་བརྩོན་པ་དང་།
en: She had a form that was dedicated to turning beings away from saṃsāra and was completely pure.

source: རྣམ་པར་དག་པའི་གཟུགས་དེ་བཞིན་ཉིད་དང་། མཉམ་པར་རྣམ་པར་མི་རྟོག་པ་དང་།
en: She had a form that, like the true nature, was without conceptualization and had that kind of mode.

source: རྣམ་པ་དེ་ལྟ་བུའི་གཟུགས་གཟུགས་མེད་པར་གཟུགས་སུ་སྣང་བ་དང་།
en: She had a form that appeared as form without having form and was without sensation.

source: ཚོར་བ་མེད་པའི་གཟུགས་ཀྱིས་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་གྱི་ཚོར་བ་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་བརྩོན་པ་དང་།
en: She had a form that was dedicated to the cessation of the sensations of worldly suffering and was above all the conceptualizations of beings.

source: འདུ་ཤེས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པའི་གཟུགས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདུ་ཤེས་ཀྱི་རྣམ་པས་རྣམ་པར་དམིགས་པ་དང་།
en: She had a form that was perceived by the perceptions of all beings and arose through the nature of not being formed.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པའི་ཆོས་ཉིད་ཀྱིས་བྱུང་བའི་གཟུགས་ཆོས་སྒྱུ་མའི་རྣམ་པས་གྲུབ་པ་དང་།
en: She had a form that occurred through the quality of illusory conjuration and transcended being an object of consciousness.

source: རྣམ་པར་ཤེས་པའི་ཡུལ་ལས་ཡོངས་སུ་འདས་པའི་གཟུགས་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཀྱི་ཡེ་ཤེས་ལས་བྱུང་བ་དང་།
en: She had a form that arose from the wisdom of bodhisattva prayer and had no nature of its own.

source: རང་བཞིན་མེད་པའི་གཟུགས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཚིག་གི་ལམ་ལ་གཞོལ་བ་དང་།
en: She had a form that engaged in the languages of all beings and dispelled pain.

source: གདུང་བ་ཡོངས་སུ་བསྩལ་བའི་གཟུགས་ཆོས་ཀྱི་སྐུ་བསིལ་བ་དམ་པ་དང་ལྡན་པས། ལྷ་མོ་སྒྱུ་མ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བའི་གཟུགས་ཀྱི་ལུས་ཡོངས་སུ་སྟོན་པ་དང་།
en: Through possessing the supreme coolness of the Dharma body, Māyādevī revealed a form body in accordance with the aspirations of beings.

source: སེམས་ཅན་གྱི་བསམ་པའི་དབང་དུ་འགྲོ་བ་ཐམས་ཅད་དང་མཉམ་ཞིང་འདྲ་བའི་གཟུགས་ཀྱི་ལུས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་གཟུགས་ཀྱི་ལུས་ལས་འཕགས་པ་སྟོན་ཅིང་འདུག་པ་མཐོང་ངོ་། །
en: In accordance with the aspirations of beings, she manifested bodies that resembled those of all beings and were superior to the form bodies of all beings.

source: དེ་ལ་སེམས་ཅན་ལ་ལས་ནི་ལྷ་མོ་སྒྱུ་མ་དེ་བདུད་ཀྱི་བུ་མོའི་གཟུགས་སུ་འདུག་ལ་བདུད་ཀྱི་བུ་མོའི་གཟུགས་བས་ཀྱང་ལྷག་པར་མཐོང་ངོ་། །
en: Some beings saw Māyādevī in the form of a daughter of Māra but superior to the form of a daughter of Māra.

source: ལ་ལས་ནི་དབང་བསྒྱུར་གྱི་ལྷའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་། །
en: Some saw her as superior through having the form of one of Vaśavartin’s apsarases.

source: ལ་ལས་ནི་རབ་འཕྲུལ་དགའི་ལྷའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་། །
en: Some saw her as superior through having the form of one of Sunirmita’s apsarases.

source: ལ་ལས་ནི་རབ་དགའ་ལྡན་གྱི་ལྷའི་བུ་མོའི་གཟུགས་བས་ཀྱང་ལྷག་པར་མཐོང་ངོ་། །
en: Some saw her as superior through having the form of one of Saṃtuṣita’s apsarases.

source: ལ་ལས་ནི་རབ་མཚེ་མའི་ལྷའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་། །
en: Some saw her as superior through having the form of one of Suyāma’s apsarases.

source: ལ་ལས་ནི་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་། །
en: Some saw her as superior through having the form of a Trāyastriṃśa apsaras.

source: ལ་ལས་ནི་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་། །
en: Some saw her as superior through having the form of a Caturmahārājika apsaras.

source: ལ་ལས་ནི་གྲུལ་བུམ་གྱི་བུ་མོའི་གཟུགས་བས་ཀྱང་ལྷག་པར་མཐོང་ངོ་། །
en: Some saw her as superior through having the form of a daughter of a lord of kumbhāṇḍas.

source: ལ་ལས་ནི་ལྟོ་འཕྱེ་ཆེན་པོའི་དབང་པོའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་། །
en: Some saw her as superior through having the form of a daughter of a lord of mahoragas.

source: སེམས་ཅན་ལ་ལས་ནི་ལྷ་མོ་སྒྱུ་མ་དེ་མིའི་དབང་པོའི་བུ་མོའི་གཟུགས་པས་ཀྱང་ལྷག་པར་མཐོང་ངོ་། །
en: Some beings saw her as superior through having the form of a daughter of a lord of humans.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་གཟུགས་ཀྱི་འདུ་ཤེས་དང་བྲལ་ཡང་སེམས་ཅན་ཕ་རོལ་གྱི་བསམ་པ་ལ་འཇུག་པ་དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པའི་རྣམ་པ་ལ་ལྷ་མོ་སྒྱུ་མ་འགྲོ་བ་ཐམས་ཅད་ཉེ་བར་འཚོ་བའི་བསོད་ནམས་དང་ལྡན་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བསོད་ནམས་ཀྱིས་བསྒྲུབས་པའི་ལུས་དང་ལྡན་པ། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྦྱོར་བ་ཐ་མི་དད་པ་དང་ལྡན་པ། འགྲོ་བ་ཐམས་ཅད་ལ་མཉམ་པ་ཉིད་ཀྱི་ཞུགས་པ། སྙིང་རྗེ་ཆེན་པོའི་ལྷས་སུ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྡུད་པ། དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་ཐམས་ཅད་ལ་ནན་ཏན་དུ་བྱས་པས་བྱུང་བ། བཟོད་པ་ཐམས་ཅད་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་ཞུགས་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཤུགས་ཀྱིས་སེམས་ཅན་རྣམ་པར་སྤེལ་བ། ཆོས་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་ཕྱིར་མི་ལྡོག་པའི་བརྩོན་འགྲུས་དང་ལྡན་པ། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པས་བྱུང་བ། བསམ་གཏན་གྱི་ཡན་ལག་དང་ཚུལ་ཐམས་ཅད་ལས་ཡོངས་སུ་གྲུབ་པའི་སེམས་དང་ལྡན་པ། བསམ་གཏན་གྱི་ཡན་ལག་ཐ་མི་དད་པའི་ཡུལ་ཡོངས་སུ་འཛིན་པའི་དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་གྱི་དཀྱིལ་འཁོར་སྣང་བ་རབ་ཏུ་ཐོབ་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་རྒྱ་མཚོ་བསྐམ་པ་ལ་ཤིན་ཏུ་གདོན་མི་ཟ་བར་བྱས་པའི་ངེས་པར་རྟོག་པ་སྣ་ཚོགས་ལ་གནས་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་རྣམ་པར་དབྱེ་བའི་ཚུལ་ལ་མཁས་པ། ཆོས་ཐམས་ཅད་ཀྱི་ཚུལ་རྒྱ་མཚོ་རྣམ་པར་དཔྱད་པའི་ཤེས་རབ་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཐོང་བས་མ་ངོམས་པ། དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ལ་རྣམ་པར་ལྟ་བའི་རྒྱུན་མི་གཅོད་པ། སངས་རྒྱས་ཐམས་ཅད་ལྟ་བའི་སྒོ་ལ་མངོན་དུ་གྱུར་བ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བསྒྲུབས་པའི་ལམ་ཡོངས་སུ་དག་པར་བྱ་བ་རྣམ་པ་ཐ་དད་པའི་ཚུལ་ལ་མཁས་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་ནམ་མཁའ་དང་མཉམ་པ་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་ཐབས་ཀྱི་ཚུལ་ལ་མཁས་པ། འགྲོ་བ་མཐའ་དང་དབུས་མེད་པ། བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་སྣང་བ་རབ་ཏུ་ཐོབ་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྐུ་རྣམ་པར་དག་པ་རྣམ་པ་ཐ་དད་པ་ལ་ཞུགས་པ། ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་སྨོན་ལམ་དང་ལྡན་པ། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་རྣམ་པར་གདུལ་བའི་བྱིན་གྱི་རླབས་མཐར་ཐུག་པར་བྱ་བའི་སྨོན་ལམ་ཡོངས་སུ་དག་པ། དེ་བཞིན་གཤེགས་པའི་ཡུལ་ཐམས་ཅད་མཆོད་པས་རྒྱས་པར་དགང་བའི་སེམས་དང་། ལྡན་པ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ལ་བརྩོན་པས་བྱུང་བ། ཆོས་ཀྱི་སྐུ་བླ་ན་མེད་པ་ཡོངས་སུ་དག་པ་དང་ལྡན་པ། གཟུགས་ཀྱི་ལུས་མཐའ་ཡས་པ་ཡོངས་སུ་སྟོན་པ། བདུད་ཀྱི་དཔུང་ཐམས་ཅད་རབ་ཏུ་འཇོམས་པ། དགེ་བའི་རྩ་བ་ཤིན་ཏུ་རྒྱ་ཆེན་པོའི་སྟོབས་དང་ལྡན་པ། ཆོས་ཀྱི་སྟོབས་རབ་ཏུ་སྐྱེས་པའི་བློ་ཅན། སངས་རྒྱས་ཀྱི་སྟོབས་སྣང་བ་རབ་ཏུ་ཐོབ་པ། བྱང་ཆུབ་སེམས་དཔའི་དབང་ཐམས་ཅད་ཀྱི་སྟོབས་ཡོངས་སུ་རྫོགས་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤུགས་ཀྱི་སྟོབས་ཡོངས་སུ་སྐྱེས་པ། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་གློག་གིས་ཤེས་རབ་སྣང་བར་བྱས་པ། སེམས་ཅན་མཐའ་དང་དབུས་མེད་པའི་སེམས་རྒྱ་མཚོ་རྣམ་པར་དཔྱད་པ་ལ་མཁས་པ། འགྲོ་བ་ཤིན་ཏུ་མང་བའི་བསམ་པ་ལ་ཞུགས་པ། སེམས་ཅན་ཕ་རོལ་གྱི་དབང་པོ་རྣམ་པ་ཐ་དད་པ་ཤེས་པར་བྱ་བའི་ཚུལ་ལ་མཁས་པ། སེམས་ཅན་མཐའ་ཡས་པའི་མོས་པ་རྣམ་པ་ཐ་དད་པའི་རྒྱུས་ལ་མཁས་པར་ཁོང་དུ་ཆུད་པ། ཕྱོགས་བཅུའི་ཞིང་རྒྱ་མཚོ་ཚད་མེད་པ་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་པ། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པ་ཐ་དད་པ་ཐམས་ཅད་ཤེས་པར་བྱ་བའི་ཚུལ་དང་། རྣམ་པ་ལ་མཁས་པ། ཞིང་ཐ་དད་པའི་ཚུལ་ཐམས་ཅད་ཤེས་པར་བྱ་བའི་ཚུལ་ལ་མཁས་པའི་རྗེས་སུ་སོང་བ། ཡེ་ཤེས་ཀྱི་ལྟ་བ་ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་དུ་རབ་ཏུ་འདལ་བ། དུས་རྒྱ་མཚོ་ཐམས་ཅད་དུ་ཁྱབ་པའི་བློ་དང་ལྡན་པ། སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་ལ་མངོན་སུམ་དུ་འདུད་པའི་ལུས་ཅན། ཆོས་ཀྱི་སྤྲིན་རྒྱ་མཚོའི་ཆར་ཐམས་ཅད་ཡང་དག་པར་གཟུང་བ་ལ། མངོན་ཏུ་གྱུར་པའི་སེམས་དང་ལྡན་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་རབ་ཏུ་རྫོགས་པར་བྱ་བའི་ནན་ཏན་གྱིས་འབྱུང་བ་ལ་རབ་ཏུ་བརྩོན་པ། བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ཡོངས་སུ་བསྒྲུབ་པ་ལ་རབ་ཏུ་ཞུགས་པའི་བློ་དང་ལྡན་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རབ་ཏུ་འཇུག་པ་ལ་རྣམ་པར་དཔྱོད་པའི་མཐུ་ཡོད་པ། བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་ཡན་ལག་ཐམས་ཅད་ཡོངས་སུ་གྲུབ་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱང་བ་ལ་རབ་ཏུ་བརྩོན་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ལེགས་པའི་སྤྲིན་ཀུན་ཏུ་སྣང་བ་རབ་ཏུ་སྟོན་པ། བྱང་ཆུབ་སེམས་དཔའ་དང་རྒྱལ་བ་ཐམས་ཅད་སྐྱེད་པའི་སྨོན་ལམ་གྱིས་བྱུང་བ་དང་།
en: Sudhana, the head merchant’s son, although devoid of the concepts of the forms of all beings, was comprehending the thoughts of other beings, and he saw that in the thoughts of all beings Māyādevī had the merit to care for all beings; she had a body created by the merit of omniscience; she was inseparable from the practice of the perfection of generosity; she engaged equally with all beings; she gathered all beings into the enclosure of great compassion; she manifested from the practice of all the qualities of the tathāgatas; she had entered an ocean of all the ways of patience; she increased mentation through the power of the diligence of omniscience; she possessed the constant diligence that purified the entire field of phenomena; she had arisen from the realization of the nature of phenomena; she possessed a mind that had accomplished all the ways of the branches of dhyāna; she had attained the illumination of the field of dhyāna of the tathāgatas that possesses the undifferentiated range of the branches of dhyāna; she dwelled in various realizations of how to definitively dry up the ocean of the kleśas of all beings; she had skill in the way of differentiating the Dharma wheels of all tathāgatas; she had the wisdom to analyze the ocean of all the ways of the Dharma; she never had enough of seeing all the tathāgatas; she had the continuous vision of the successions of the tathāgatas in the three times; she faced the gateway to seeing all the buddhas; she was skilled in the different ways of purifying the path accomplished by all the tathāgatas; she had the field of activity of the tathāgatas, which is as extensive as space; she was skilled in the ways of the method of gathering all beings; she had appearances that ripened and guided the vast extent of beings, without end or middle, in accordance with their aspirations; she comprehended the different pure bodies of all buddhas; she had the prayer to purify the ocean of all realms; she had the pure prayer to reach the conclusion of having the presence with the power to guide all realms of beings; she had a mind that fills with offering the field of all buddhas; she had arisen from dedication to all the miraculous manifestations of bodhisattvas; she possessed the pure, unsurpassable Dharma body; she manifested endless form bodies; she defeated all the armies of Māra; she possessed the strength of vast roots of merit; she had a mind that generated the strength of the Dharma; she had attained the illumination of the strengths of the buddhas; she had perfected the strength of all the powers of a bodhisattva; she had developed the strength of the power of omniscience; she had illuminated wisdom with the lightning of the wisdom of the tathāgatas; she was skilled in examining the ocean of the minds of the vast, centerless, endless extent of beings; she comprehended the aspirations of the multitudes of beings; she was skilled in the ways of knowing the different capabilities of other beings; she had realized the skill in knowing the various aspirations of infinite beings; she filled the measureless ocean of realms in the ten directions with her bodies; she was skilled in the aspects and ways of knowing all the different world realms; she had acquired skill in the ways of knowing all the modes of different realms; she spread the view of wisdom throughout the ocean of all directions; she had the understanding that pervades all the ocean of all time; she had bodies that bow down directly to the ocean of all buddhas; she had a mind that directly acquired all the rain from the ocean of the clouds of the Dharma; she was dedicated to coming forth through the practice of completing the qualities of all the tathāgatas; she had the understanding that engaged in accomplishing all the accumulations of the bodhisattvas; she possessed the power of analyzing the progress of all bodhisattvas; she accomplished all the aspects of the aspiration to enlightenment; she was engaged in protecting all bodhisattvas; she manifested the light of the clouds of the goodness of all buddhas; and she had arisen from the prayers that give birth to all bodhisattvas and jinas.

source: དེ་དག་ལ་སོགས་པ་མཐོང་བའི་ཚུལ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས་ལྷ་མོ་སྒྱུ་མ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཐོང་བར་གྱུར་ཏོ། །
en: Sudhana, the head merchant’s son, saw Māyādevī in those ways and in other ways as numerous as the atoms in Jambudvīpa.

source: དེས་དེ་མཐོང་ནས་ལྷ་མོ་སྒྱུ་མ་ཇི་སྙེད་ཡོད་པ་དེ་སྙེད་དུ་བདག་གི་ལུས་བྱིན་གྱིས་བརླབས་ནས། ཕྱོགས་ཐམས་ཅད་ལ་མངོན་ཏུ་བལྟས་པའི་ལྷ་མོ་སྒྱུ་མ་ལ་ཐམས་ཅད་དུ་ཁྱབ་པའི་ལུས་ཀྱིས་ཕྱག་བྱས་སོ། །
en: Having seen that, he blessed his own body to be as numerous as those of Māyādevī and bowed down to them with bodies that spread among them all.

source: དེས་དེ་ལྟར་ཕྱག་བྱས་མ་ཐག་ཏུ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་མཐའ་དང་དབུས་མེད་པ་ཐོབ་པར་གྱུར་ཏེ། དེས་ཏིང་ངེ་འཛིན་གྱི་སྒོ་དེ་དག་ལ་རྣམ་པར་བལྟས་ནས། མཚན་མར་བྱ་བ་དང་། བསྒོམ་པ་དང་། ལྷུར་བླང་བ་དང་།
en: The instant he bowed down, he attained a vast extent, without middle or end, of entrances to samādhi.

source: རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། རྒྱས་པར་དགང་བ་དང་། རབ་ཏུ་རྒྱ་ཆེར་བྱ་བ་དང་། བལྟ་བ་དང་། རྣམ་པར་སྤེལ་བ་དང་། མངོན་པར་བསྒྲུབ་པ་དང་།
en: He looked upon those entrances to samādhi, identified their characteristics, meditated on them, devoted himself to them, remembered them, pervaded them, made them vast, viewed them, increased them, accomplished them, and sealed them.

source: རྒྱས་གདབ་པར་བྱས་ཏེ། ཏིང་ངེ་འཛིན་གྱི་སྒོ་དེ་དག་ལས་ལངས་ནས་ལྷ་མོ་སྒྱུ་མ་འཁོར་དང་བཅས། གནས་དང་བཅས། སྟན་དང་བཅས་པ་ལ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ།
en: He arose from those entrances to samādhi and circumambulated Māyādevī and her entourage, keeping her to his right, and their residence and seats.

source: མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བ་ལ་ཡོངས་སུ་བསྐུལ་བ་བགྱིས་པ་སྟེ།
en: Then he stood before her with hands together in homage and said, “Āryā, through Mañjuśrī Kumāra­bhūta I have developed the aspiration for the highest, complete enlightenment and was inspired to honor the kalyāṇamitras.

source: དེ་ལྟར་བདག་དགེ་བའི་བཤེས་གཉེན་ནས་དགེ་བའི་བཤེས་གཉེན་དུ་བསྙེན་བཀུར་བགྱིད་ཅིང་མཐར་གྱིས་ཁྱོད་ཀྱི་ཞབས་ཀྱི་དྲུང་འདིའི་བར་དུ་མཆིས་པ་ལགས་ན།
en: In that way, I have honored one kalyāṇamitra after another and have finally come to your feet.

source: འཕགས་མ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབས་ན། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འགྲུབ་པ་ལགས།
en: “Āryā, how does a bodhisattva train in bodhisattva conduct and accomplish omniscience?”

source: དེས་སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྨོན་ལམ་ཆེན་པོའི་ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པས་རྣམ་པར་བརྒྱན་པ་ཐོབ་པ་སྟེ།
en: Māyādevī answered, “Noble one, I have attained the bodhisattva liberation called the display of the illusory conjurations of wisdom of the great prayers.
